#### Terraform Apply 🎬`failure`

<details><summary>Show Result</summary>

```

terraform
data.aws_resourcegroupstaggingapi_resources.ecs_cluster: Reading...
data.aws_vpc.vpc: Reading...
data.aws_resourcegroupstaggingapi_resources.alb: Reading...
data.aws_security_group.ecs: Reading...
data.aws_resourcegroupstaggingapi_resources.alb: Read complete after 0s [id=aws]
data.aws_lb_listener.alb_listener: Reading...
data.aws_resourcegroupstaggingapi_resources.ecs_cluster: Read complete after 0s [id=aws]
data.aws_security_group.ecs: Read complete after 0s [id=sg-0a4da3a6cadecdb46]
data.aws_lb_listener.alb_listener: Read complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:369168831564:listener/app/tf-lb-20230116125743651400000008/908d01a8ba2edfb0/cbaae90a9c597e5f]
data.aws_vpc.vpc: Read complete after 0s [id=vpc-09588034d45d4bae9]
data.aws_subnets.subnets: Reading...
data.aws_subnets.subnets: Read complete after 0s [id=us-east-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.log-group will be created
  + resource "aws_cloudwatch_log_group" "log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "demo-fargate-app-logs"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_ecr_repository.app_container_repo will be created
  + resource "aws_ecr_repository" "app_container_repo" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "demo-fargate-app"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = false
        }
    }

  # aws_ecs_service.service will be created
  + resource "aws_ecs_service" "service" {
      + cluster                            = "arn:aws:ecs:us-east-1:369168831564:cluster/ecs-fargate"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 50
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "demo-fargate-app"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "demo-fargate-app"
          + container_port   = 8080
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0a4da3a6cadecdb46",
            ]
          + subnets          = [
              + "subnet-05bbd722c95dce46e",
              + "subnet-069f38a28c0fd50b1",
              + "subnet-0e744c5ae26360bdc",
            ]
        }
    }

  # aws_ecs_task_definition.task_def will be created
  + resource "aws_ecs_task_definition" "task_def" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "demo-fargate-app"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "environment" = "dev"
          + "project"     = "demo"
        }
      + tags_all                 = {
          + "environment" = "dev"
          + "project"     = "demo"
        }
      + task_role_arn            = (known after apply)
    }

  # aws_iam_role.ecs_task_execution_role will be created
  + resource "aws_iam_role" "ecs_task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo-fargate-app-ecsTaskExecutionRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.ecs_task_role will be created
  + resource "aws_iam_role" "ecs_task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo-fargate-app-ecsTaskRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment will be created
  + resource "aws_iam_role_policy_attachment" "ecs-task-execution-role-policy-attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "demo-fargate-app-ecsTaskExecutionRole"
    }

  # aws_lb_listener_rule.listener_rule will be created
  + resource "aws_lb_listener_rule" "listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:us-east-1:369168831564:listener/app/tf-lb-20230116125743651400000008/908d01a8ba2edfb0/cbaae90a9c597e5f"
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {

          + path_pattern {
              + values = [
                  + "/",
                ]
            }
        }
    }

  # aws_lb_target_group.alb_ecs_tg will be created
  + resource "aws_lb_target_group" "alb_ecs_tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-09588034d45d4bae9"

      + health_check {
          + enabled             = (known after apply)
          + healthy_threshold   = (known after apply)
          + interval            = (known after apply)
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = (known after apply)
          + protocol            = (known after apply)
          + timeout             = (known after apply)
          + unhealthy_threshold = (known after apply)
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.
aws_iam_role.ecs_task_role: Creating...
aws_cloudwatch_log_group.log-group: Creating...
aws_iam_role.ecs_task_execution_role: Creating...
aws_ecr_repository.app_container_repo: Creating...
aws_lb_target_group.alb_ecs_tg: Creating...
aws_cloudwatch_log_group.log-group: Creation complete after 0s [id=demo-fargate-app-logs]
aws_ecr_repository.app_container_repo: Creation complete after 0s [id=demo-fargate-app]
aws_lb_target_group.alb_ecs_tg: Creation complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:369168831564:targetgroup/tf-20230116161619809000000001/18aa39592593ee28]
aws_lb_listener_rule.listener_rule: Creating...
aws_iam_role.ecs_task_execution_role: Creation complete after 0s [id=demo-fargate-app-ecsTaskExecutionRole]
aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment: Creating...
aws_iam_role.ecs_task_role: Creation complete after 0s [id=demo-fargate-app-ecsTaskRole]
aws_ecs_task_definition.task_def: Creating...
aws_lb_listener_rule.listener_rule: Creation complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:369168831564:listener-rule/app/tf-lb-20230116125743651400000008/908d01a8ba2edfb0/cbaae90a9c597e5f/6f83dee41c11cc28]
aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment: Creation complete after 0s [id=demo-fargate-app-ecsTaskExecutionRole-20230116161620443900000002]

```

</details>
